Repository: albertolesionato/storyboard
Catalog: packages/features/sign_*/lib/src/l10n/messages_*.arb
Languages: ar

# appBarTitle
source: Sign In
ar: تسجيل الدخول

# usernameTextFieldLabel
source: Username
ar: اسم المستخدم

# passwordTextFieldLabel
source: Password
ar: كلمة المرور

# forgotMyPasswordButtonLabel
source: Forgot my password
ar: نسيت كملة المرور

# signInButtonLabel
source: Sign In
ar: تسجيل الدخول

# signUpOpeningText
source: Don't have an account?
ar: لا يوجد لديك حساب؟

# signUpButtonLabel
source: Sign up
ar: إنشاء حساب

# invalidCredentialsErrorMessage
source: Invalid email and/or password.
ar: .خطأ في البريد الألكتروني او كلمة المرور

# usernameTextFieldEmptyErrorMessage
source: Your username can't be empty.
ar: .اسم المستخدم مطلوب

# usernameTextFieldInvalidErrorMessage
source: This username is not valid.
ar: .اسم المستخدم غير صالح

# usernameTextFieldAlreadyRegisteredErrorMessage
source: This username is already registered.
ar: .اسم المستخدم مسجل غير متوفر

# passwordTextFieldEmptyErrorMessage
source: Your password can't be empty.
ar: .كلمة المرور مطلوبة

# passwordTextFieldInvalidErrorMessage
source: Password must be at least five characters long.
ar: .يجب أن تتكون كلمة المرور من 8 رموز على الأقل
